tap "arl/arl"
tap "danielgatis/imgcat"
tap "felixkratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "bat"
brew "btop"
brew "direnv"
brew "entr"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnmic"
brew "go"
brew "goreleaser"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "netcat"
brew "node"
brew "pipx"
brew "poetry"
brew "python@3.12"
brew "rename"
brew "ripgrep"
brew "sesh"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "uv"
brew "wget"
brew "yq"
brew "zoxide"
brew "arl/arl/gitmux"
brew "danielgatis/imgcat/imgcat"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "aerospace"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "font-ubuntu-mono-nerd-font"
cask "ghostty"
cask "kitty"
cask "neovide"
cask "obsidian"
cask "orbstack"
cask "quarto"
cask "sf-symbols"
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "MyWallpaper", id: 1552826194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Widgetter", id: 1553223588
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "vscodevim.vim"
